{"modelTopology": {"training_config": {"loss_weights": null, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "optimizer_config": {"class_name": "Adam", "config": {"amsgrad": false, "decay": 0.0, "epsilon": 1e-07, "beta_1": 0.8999999761581421, "lr": 0.0010000000474974513, "beta_2": 0.9990000128746033}}}, "backend": "tensorflow", "keras_version": "2.1.6", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"trainable": true, "kernel_size": [5, 5], "use_bias": true, "padding": "same", "dtype": "float32", "activation": "relu", "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_1", "filters": 30, "strides": [1, 1], "batch_input_shape": [null, 28, 28, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_size": [3, 3], "use_bias": true, "padding": "same", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_2", "filters": 15, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "softmax", "kernel_constraint": null, "units": 10, "name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}]}}, "weightsManifest": [{"weights": [{"name": "conv2d_1/kernel", "shape": [5, 5, 1, 30], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [30], "dtype": "float32"}], "paths": ["group1-shard1of1"]}, {"weights": [{"name": "conv2d_2/kernel", "shape": [3, 3, 30, 15], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [15], "dtype": "float32"}], "paths": ["group2-shard1of1"]}, {"weights": [{"name": "dense_1/kernel", "shape": [735, 10], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [10], "dtype": "float32"}], "paths": ["group3-shard1of1"]}]}